#1 2 3 4 5 6 7 8 9 XD
print(1,2,3,4,5,6,7,8,9,"XD")

'''
可移到print()看細項
預設sep=" "(逗號分隔的值中間以空格顯示)
預設end=\n (print與下一個print之間預設會換行)
'''

#可改變預設空格
#123456789XD
print(1,2,3,4,5,6,7,8,9,"XD",sep="") 
#1-2-3-4-5-6-7-8-9-XD
print(1,2,3,4,5,6,7,8,9,"XD",sep="-") 
#1*2*3*4*5*6*7*8*9*XD
print(1,2,3,4,5,6,7,8,9,"XD",sep="*") 

#可取消預設\n
#1 2 3 4 5 6 7 8 9 XD你看我沒有換行吧~
print(1,2,3,4,5,6,7,8,9,"XD",end="") 
print("你看我沒有換行吧~")

'''
轉型
'''
print(int("100"))
print(float("3.14"))
print(float("100"))
print(str(100))

print(int("3.14")) #浮點數無法以這種方式轉成int
a=float("3.14")
b=int(a)
print(b) #顯示結果為3(只顯示整數部分)
